## A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.

In [32]:
import scipy.stats as stats
from scipy.stats import chi2_contingency

import statsmodels.api as sm
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings("ignore")
from PIL import ImageGrab
import matplotlib.pyplot as plt
import seaborn as sns

In [149]:
a = pd.read_csv("Cutlets.csv")

In [150]:
a

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [151]:
a.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [152]:
a.isnull().sum()

Unit A    0
Unit B    0
dtype: int64

In [153]:
a.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
dtype: bool

In [154]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  35 non-null     float64
 1   Unit B  35 non-null     float64
dtypes: float64(2)
memory usage: 688.0 bytes

In [155]:
alpha= 0.05

In [156]:
tstats,pvalue = stats.ttest_ind(a['Unit A'],a['Unit B'])

In [157]:
tstats

0.7228688704678063

In [158]:
pvalue

0.4722394724599501

In [159]:
if pvalue >= alpha:
    print ("we accept the null hyp, m1=m2")

we accept the null hyp, m1=m2

#    A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.
   
  Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.

In [160]:
lab= pd.read_csv("LabTAT.csv")

In [161]:
lab

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [162]:
alpha = 0.05

In [163]:
lab.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [164]:
lab.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory 1  120 non-null    float64
 1   Laboratory 2  120 non-null    float64
 2   Laboratory 3  120 non-null    float64
 3   Laboratory 4  120 non-null    float64
dtypes: float64(4)
memory usage: 3.9 KB

In [165]:
lab[lab.duplicated()]

Empty DataFrame
Columns: [Laboratory 1, Laboratory 2, Laboratory 3, Laboratory 4]
Index: []

In [166]:
lab.isnull().sum()

Laboratory 1    0
Laboratory 2    0
Laboratory 3    0
Laboratory 4    0
dtype: int64

In [167]:
ftest,pvalue = stats.f_oneway(lab["Laboratory 1"],lab["Laboratory 2"],lab["Laboratory 3"],lab["Laboratory 4"])

In [168]:
ftest

118.70421654401437

In [169]:
pvalue

2.1156708949992414e-57

In [170]:
if pvalue<=alpha:
    print("we reject null hyp, There is sig diff in TAT of labs")

we reject null hyp, There is sig diff in TAT of labs

#  Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.

In [171]:
bratio = pd.read_csv("BuyerRatio.csv")

In [172]:
bratio

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [173]:
alpha = 0.05

In [174]:
table= [[50,142,131,70],[435,1523,1356,750]]

In [175]:
stat,p,dof,exp = stats.chi2_contingency(table)

In [176]:
print (stat,p,dof,exp)

1.595945538661058 0.6603094907091882 3 [[  42.76531299  146.81287862  131.11756787   72.30424052]
 [ 442.23468701 1518.18712138 1355.88243213  747.69575948]]

In [206]:
observed = ([50,142,131,70,435,1523,1356,750])
expected = ([42.76531299,146.81287862,131.11756787,72.30424052,442.23468701,
                     1518.18712138,1355.88243213,747.69575948])

In [209]:
stats,p_value = stats.chisquare(observed,expected,ddof=3)
print(p_value)
print(stats)

0.8095206646905712
1.5959455390914483

In [197]:
if p_value >= alpha:
    print ("we accept the null hyp NOT ALL PROPORTIONS ARE EQUAL")

we accept the null hyp NOT ALL PROPORTIONS ARE EQUAL

## TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences

In [5]:
cx= pd.read_csv('Costomer+OrderForm.csv')

In [6]:
cx

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [7]:
alpha4 = 0.05

In [9]:
cx.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [10]:
cx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Phillippines  300 non-null    object
 1   Indonesia     300 non-null    object
 2   Malta         300 non-null    object
 3   India         300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

Checking value counts in data

In [15]:
print(cx['Phillippines'].value_counts())

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [16]:
print(cx['Indonesia'].value_counts())

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [17]:
print(cx['Malta'].value_counts())

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [18]:
print(cx['India'].value_counts())

Error Free    280
Defective      20
Name: India, dtype: int64

In [19]:
cont=[[271,267,269,280],
      [29,33,31,20]]

In [33]:
stats1,p,df,exp = stats.chi2_contingency(cont)

In [40]:
print (stats1,p,df,exp)

3.858960685820355 0.2771020991233135 3 [[271.75 271.75 271.75 271.75]
 [ 28.25  28.25  28.25  28.25]]

In [41]:
observed1 =([271,267,269,280,29,33,31,20])

In [45]:
expected1 =([271.75,271.75,271.75,271.75,28.25,28.25,28.25,28.25])

In [47]:
st,pval= stats.chisquare(observed1, expected1, ddof = 3)
print(st)
print(pval)

3.858960685820355
0.4254298144535761

In [53]:

    print("we reject null hyp")

we reject null hyp